tutorials/cfdemSolverPiso/periodicChannel/CFD/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1024;
        startFace       5568;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          64;
        startFace       6592;
        matchTolerance  0.0001;
        transform       translational;
        neighbourPatch  inlet;
        separationVector (-0.4 0 0);
    }
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          64;
        startFace       6656;
        matchTolerance  0.0001;
        transform       translational;
        neighbourPatch  outlet;
        separationVector (0.4 0 0);
    }
)

// ************************************************************************* //
